tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/formula-analytics"
tap "homebrew/services"
tap "homebrew/test-bot"
tap "charmbracelet/tap"
# Extendable version manager with support for Ruby, Node.js, Erlang & more
brew "asdf"
# Tool for generating GNU Standards-compliant Makefiles
brew "automake"
# Official Amazon AWS command-line interface
brew "awscli"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Cross-platform make
brew "cmake"
# Disk Usage/Free Utility - a better 'df' alternative
brew "duf"
# More intuitive version of du in rust
brew "dust"
# Modern, maintained replacement for ls
brew "eza"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Command-line fuzzy finder written in Go
brew "fzf"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# Syntax-highlighting pager for git and diff output
brew "git-delta"
# Render markdown on the CLI
brew "glow"
# GNU version of the tar archiving utility
brew "gnu-tar"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg"
# Improved top (interactive process viewer)
brew "htop"
# User-friendly cURL replacement (command-line HTTP client)
brew "httpie"
# Clone of ls with colorful output, file type icons, and more
brew "lsd"
# Fly through your shell history
brew "mcfly"
# AI on the command-line
brew "mods"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Cryptography and SSL/TLS Toolkit
brew "openssl"
# Library for command-line editing
brew "readline"
# Add GitHub support to git on the command-line
brew "hub"
# Lightweight and flexible command-line JSON processor
brew "jq"
# JSON parser and validator with a CLI
brew "jsonlint"
# Mac App Store command-line interface
brew "mas"
# High performance, distributed memory object caching system
brew "memcached", restart_service: true
# Robust (fully ACID) transactional property graph database
brew "neo4j"
# Simplistic interactive filtering tool
brew "peco"
# Passphrase entry dialog utilizing the Assuan protocol
brew "pinentry"
# Object-relational database system
brew "postgresql", restart_service: true
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Static analysis and lint tool, for (ba)sh scripts
brew "shellcheck"
# Autoformat shell script source code
brew "shfmt"
# Add a public key to a remote machine's authorized_keys file
brew "ssh-copy-id"
# Internet file retriever
brew "wget"
# Fast CSV toolkit written in Rust
brew "xsv"
# Application launcher and productivity software
cask "alfred"
# Application uninstaller
cask "appcleaner"
# API documentation browser
cask "dash"
# SQL client
cask "datagrip"
# Voice and text chat software
cask "discord"
# Client for the Dropbox cloud storage service
cask "dropbox"
# Web browser
cask "firefox"
# Web browser
cask "firefox-developer-edition"
# GIT client
cask "fork"
# Web browser
cask "google-chrome"
# Set of tools to manage resources and applications hosted on Google Cloud
cask "google-cloud-sdk"
# Tool to optimize images to a smaller size
cask "imageoptim"
# None
cask "java8"
# Tool to prevent the system from going into sleep mode
cask "keepingyouawake"
# Animated screen capture application
cask "licecap"
# Silence embarrassing notifications while screensharing
cask "muzzle"
# Robust (fully ACID) transactional property graph database
cask "neo4j"
# Get up and running with large language models locally
cask "ollama"
# Replacement for Docker Desktop
cask "orbstack"
# Password manager that keeps all passwords secure behind one password
cask "1password"
# Command-line helper for the 1Password password manager
cask "1password-cli"
# GUI client for PostgreSQL databases
cask "postico"
# VPN client
cask "private-internet-access"
# Music player
cask "spotify"
# Open-source code editor
cask "visual-studio-code"
mas "DaisyDisk", id: 411643860
mas "Dash", id: 458034879
mas "Evernote", id: 406056744
# Zoom video conferencing
cask "zoom"
mas "Slack", id: 803453959
mas "Spectrum", id: 518156125
mas "Xcode", id: 497799835
