tap "charmbracelet/tap"
tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/test-bot"
# Static checker for GitHub Actions workflow files
brew "actionlint"
# Extendable version manager with support for Ruby, Node.js, Erlang & more
brew "asdf"
# Tool for generating GNU Standards-compliant Makefiles
brew "automake"
# Official Amazon AWS command-line interface
brew "awscli"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Disk Usage/Free Utility - a better 'df' alternative
brew "duf"
# More intuitive version of du in rust
brew "dust"
# Modern, maintained replacement for ls
brew "eza"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Interact with Google Gemini AI models from the command-line
brew "gemini-cli"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# Syntax-highlighting pager for git and diff output
brew "git-delta"
# Render markdown on the CLI
brew "glow"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg"
# Improved top (interactive process viewer)
brew "htop"
# Lightweight and flexible command-line JSON processor
brew "jq"
# JSON parser and validator with a CLI
brew "jsonlint"
# CLI for Node.js style checker and lint tool for Markdown files
brew "markdownlint-cli"
# Mac App Store command-line interface
brew "mas"
# Fly through your shell history
brew "mcfly"
# AI on the command-line
brew "mods"
# Robust (fully ACID) transactional property graph database
brew "neo4j"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Cryptography and SSL/TLS Toolkit
brew "openssl"
# Passphrase entry dialog utilizing the Assuan protocol
brew "pinentry"
# Object-relational database system
brew "postgresql", restart_service: :changed
# Library for command-line editing
brew "readline"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Static analysis and lint tool, for (ba)sh scripts
brew "shellcheck"
# Autoformat shell script source code
brew "shfmt"
# Human-friendly alternative to netstat for socket and port monitoring
brew "somo"
# Add a public key to a remote machine's authorized_keys file
brew "ssh-copy-id"
# Syntax-aware linter for prose
brew "vale"
# Internet file retriever
brew "wget"
# Fast CSV toolkit written in Rust
brew "xsv"
# Linter for YAML files
brew "yamllint"
# Find security issues in GitHub Actions setups
brew "zizmor"
# Password manager that keeps all passwords secure behind one password
cask "1password"
# Command-line helper for the 1Password password manager
cask "1password-cli"
# Application launcher and productivity software
cask "alfred"
# Application uninstaller
cask "appcleaner"
# Terminal-based AI coding assistant
cask "claude-code"
# Write, edit, and chat about your code with AI
cask "cursor"
# API documentation browser
cask "dash"
# SQL client
cask "datagrip"
# Voice and text chat software
cask "discord"
# Client for the Dropbox cloud storage service
cask "dropbox"
# Web browser
cask "firefox"
# Web browser
cask "firefox-developer-edition"
cask "font-sf-mono"
cask "font-signika"
cask "font-skranji"
cask "font-space-mono"
# GIT client
cask "fork"
# Web browser
cask "google-chrome"
# Set of tools to manage resources and applications hosted on Google Cloud
cask "google-cloud-sdk"
# Tool to optimize images to a smaller size
cask "imageoptim"
# None
cask "java8"
# Tool to prevent the system from going into sleep mode
cask "keepingyouawake"
# Multi-platform web browser
cask "microsoft-edge"
# Animated screen capture application
cask "licecap"
# Trims video and audio files losslessly
cask "losslesscut"
# Silence embarrassing notifications while screensharing
cask "muzzle"
# Robust (fully ACID) transactional property graph database
cask "neo4j"
# Get up and running with large language models locally
cask "ollama"
# Audiobook manager for Audible users
cask "openaudible"
# Replacement for Docker Desktop
cask "orbstack"
# GUI client for PostgreSQL databases
cask "postico"
# VPN client
cask "private-internet-access"
# Automatically hides or quits apps after periods of inactivity
cask "quitter"
# Move and resize windows using keyboard shortcuts or snap areas
cask "rectangle"
# Music player
cask "spotify"
# Virtual machines UI using QEMU
cask "utm"
# Open-source code editor
cask "visual-studio-code"
# Multiplayer code editor
cask "zed"
# Zoom video conferencing
cask "zoom"
mas "DaisyDisk", id: 411643860
mas "Dash", id: 458034879
mas "Evernote", id: 406056744
mas "Slack", id: 803453959
mas "Spectrum", id: 518156125
mas "TestFlight", id: 899247664
vscode "ban.spellright"
vscode "bastienboutonnet.vscode-dbt"
vscode "editorconfig.editorconfig"
vscode "fivethree.vscode-svelte-snippets"
vscode "foxundermoon.shell-format"
vscode "github.vscode-github-actions"
vscode "hashicorp.terraform"
vscode "innoverio.vscode-dbt-power-user"
vscode "jakeboone02.cypher-query-language"
vscode "julialang.language-julia"
vscode "monokai.theme-monokai-pro-vscode"
vscode "ms-azuretools.vscode-containers"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode-remote.vscode-remote-extensionpack"
vscode "octref.vetur"
vscode "oderwat.indent-rainbow"
vscode "rust-lang.rust-analyzer"
vscode "samuelcolvin.jinjahtml"
vscode "sorbet.sorbet-vscode-extension"
vscode "svelte.svelte-vscode"
vscode "tamasfe.even-better-toml"
vscode "timonwong.shellcheck"
vscode "vadimcn.vscode-lldb"
